/*
 * Copyright (C) 2007-2015 Apple Inc. All rights reserved.
 * Copyright (C) 2006 Apple Computer, Inc. All rights reserved.
 *
 * This document is the property of Apple Inc.
 * It is considered confidential and proprietary.
 *
 * This document may not be reproduced or transmitted in any form,
 * in whole or in part, without the express written permission of
 * Apple Inc.
 */
#include <debug.h>
#include <platform.h>
#include <drivers/display.h>
#include <lib/lzss.h>
#include <lib/mib.h>
#include <lib/paint.h>
#include <lib/syscfg.h>
#include <string.h>
#include <sys.h>
#include <sys/types.h>
#include <arch.h>
#include <target.h>
#include <lib/libiboot.h>

#define SYSCFG_DCLR_COLOR_REPORT	1	// Report colors found in 'DClr' syscfg entry
#if DEBUG_BUILD
#define SYSCFG_DCLR_OVERRIDE		1	// Allow overridding 'DClr' syscfg entry from environment for testing
#else
#define SYSCFG_DCLR_OVERRIDE		0 	// Do not honor DClr_Override on non-DEBUG builds.
#endif
#define PANIC_ON_SERIOUS_ERROR		1	// Panic if 'DClr' syscfg processing error
#define PANIC_ON_UNKNOWN_DCLR_COLOR	1	// Panic if 'DClr' syscfg version is unknown or invalid

// Nothing explicitly defines a kMIBTargetOsPictureRotate factor so use
// the value returned by kMIBTargetPictureRotate for everything.
#define kMIBTargetOsPictureRotate	kMIBTargetPictureRotate

struct iboot_image;
static int paint_draw_picture(struct iboot_image *comp_image_buf, size_t comp_image_len);
static int paint_update_image_argb(void);
static int paint_update_image_wide_gammut(void);

static void paint_install_gamma_table_channel(uint32_t entries, volatile uint32_t *channel_lut, const uint8_t *bits);
static uint8_t paint_install_gamma_get_2bits(const uint8_t *bits);

static void plot4(struct plane *p, uint32_t x, uint32_t y, uint64_t color);
static void plot8(struct plane *p, uint32_t x, uint32_t y, uint64_t color);
static void plot16(struct plane *p, uint32_t x, uint32_t y, uint64_t color);
static void plot32(struct plane *p, uint32_t x, uint32_t y, uint64_t color);
static uint32_t get_pixel4(struct plane *p, uint32_t x, uint32_t y);
static uint32_t get_pixel8(struct plane *p, uint32_t x, uint32_t y);
static uint32_t get_pixel16(struct plane *p, uint32_t x, uint32_t y);
static uint32_t get_pixel32(struct plane *p, uint32_t x, uint32_t y);
static void hline4(struct plane *p, uint32_t x, uint32_t y, uint32_t len, uint64_t color);
static void hline8(struct plane *p, uint32_t x, uint32_t y, uint32_t len, uint64_t color);
static void hline16(struct plane *p, uint32_t x, uint32_t y, uint32_t len, uint64_t color);
static void hline32(struct plane *p, uint32_t x, uint32_t y, uint32_t len, uint64_t color);
static void vline4(struct plane *p, uint32_t x, uint32_t y, uint32_t len, uint64_t color);
static void vline8(struct plane *p, uint32_t x, uint32_t y, uint32_t len, uint64_t color);
static void vline16(struct plane *p, uint32_t x, uint32_t y, uint32_t len, uint64_t color);
static void vline32(struct plane *p, uint32_t x, uint32_t y, uint32_t len, uint64_t color);
static void set_plane(struct plane *p, uint32_t y, uint32_t line_x, size_t plane_size, addr_t plane_fb, addr_t plane_db, enum colorspace cs);

static void clear_flattened_images(void);

static bool paint_ready;
static struct canvas *paint_canvas;

static uint32_t window_height;
static uint32_t window_width;
static uint32_t window_stride;
static uint32_t window_depth;
static uintptr_t window_framebuffer;

static addr_t compressed_image_base;
static size_t compressed_image_size;

struct flattened_image {
	bool		fi_color;
	uint32_t	fi_width;
	uint32_t	fi_height;
	uint32_t	fi_xstart;
	uint32_t	fi_ystart;
	uint32_t	fi_xstop;
	uint32_t	fi_ystop;
	uint8_t		*fi_buffer;
	uint32_t	fi_src_pos;
};

#define MAX_FLATTENED_IMAGES (0x1000 / sizeof(struct flattened_image))
static uint32_t flattened_images_count;
static struct flattened_image *flattened_images;
static addr_t flattened_images_base;
static addr_t flattened_images_end;

static uint64_t background_rgb;
static bool color_map_desired;
static bool color_map_enabled;
static bool color_map_supported;
static bool color_map_invalid;
static color_policy_t color_policy;
#if DEBUG_BUILD
static struct display_window *paint_window;
#endif
static addr_t last_canvas_addr;
static size_t page_size;

int paint_init(void *window, addr_t scratch, size_t scratch_size)
{
	struct display_window *w = (struct display_window *)window;
	int result = -1;

	paint_ready = false;

	if (w == NULL) {
		goto out;
	}

	paint_canvas = &w->c;

	window_height = w->height;
	window_width  = w->width;
	window_stride = w->stride;
	window_depth  = w->depth;

	//The framebuffer region should be large enough to include all planes used
	window_framebuffer = paint_canvas->fb_phys;

	compressed_image_base = scratch;
	compressed_image_size = window_height * window_stride + 0x1000;

	flattened_images = 0;
	flattened_images = (struct flattened_image *)(compressed_image_base + compressed_image_size);
	flattened_images_base = compressed_image_base + compressed_image_size + 0x1000;
	flattened_images_end = scratch + scratch_size;
	flattened_images_count = 0;

	if (flattened_images_base >= flattened_images_end) {
		dprintf(DEBUG_INFO, "Display Size is too small\n");
		goto out;
	}

	background_rgb = 0x00000000;

	paint_ready = true;

#if DEBUG_BUILD
	paint_window = w;
#endif
	result = 0;

out:
	return result;
}

static void clear_flattened_images(void)
{
	if (!paint_ready)
		return;

	flattened_images_count = 0;
	flattened_images_base = compressed_image_base + compressed_image_size + 0x1000;
}

int paint_set_bgcolor(uint16_t bg_red, uint16_t bg_green, uint16_t bg_blue)
{
	if (!paint_ready) {
		return 0;
	}

	if (paint_canvas->cs == CS_ARGB8101010) {
		background_rgb = RGB10(bg_red, bg_green, bg_blue);
	} else {
		background_rgb = RGB(bg_red, bg_green, bg_blue); 
	}

	return 0;
}

/* image_data is either 32 or 16 bits per sample with the b_alpha most significant.   */
/* The reset of the data is the rgb or grey data having already been alpha scaled.    */
/* The b_alpha value is scale with the back ground color then added to the rgb value. */

struct iboot_image {
	char		image_signature[8];	// 0x00 - 'iBootIm'
	uint32_t	image_adler32;		// 0x08
	uint32_t	image_type;		// 0x0C - 'lzss'
	uint32_t	image_format;		// 0x10 - 'argb' or 'grey'
	uint16_t	image_width;		// 0x14
	uint16_t	image_height;		// 0x16
	int16_t		image_h_offset;		// 0x18
	int16_t		image_v_offset;		// 0x1A
	uint32_t	image_data_length;	// 0x1C
	uint32_t	reserved[8];		// 0x20
	uint8_t		image_data[];		// 0x40
} __attribute__((packed));
typedef struct iboot_image iboot_image;

int paint_set_picture_for_tag(uint32_t image_tag)
{
	struct image_info *pict_info = 0;

	if (mib_get_u32(kMIBTargetApplicationProduct) == MIB_APP_PROD_IBOOT) {
		pict_info = image_find(image_tag);
		if (pict_info == 0) {
			dprintf(DEBUG_INFO, "image tag 0x%08x not found\n", image_tag);
		}
	}

	return paint_set_picture(pict_info);
}

int paint_set_picture_for_tag_list(uint32_t image_tag, int image_offset, int image_count)
{
	struct image_info *pict_info = 0;

	if (mib_get_u32(kMIBTargetApplicationProduct) == MIB_APP_PROD_IBOOT) {
		pict_info = image_find(image_tag);
		if (pict_info == 0) {
			dprintf(DEBUG_INFO, "image tag 0x%08x not found\n", image_tag);
		}
	}

	return paint_set_picture_list(pict_info, image_offset, image_count);
}

int paint_set_picture(struct image_info *pict_info)
{
	return paint_set_picture_list(pict_info, 0, 1);
}

